[
  {
    "rank": 2,
    "title": "We can now fix McDonald's ice cream machines",
    "link": "https://www.ifixit.com/News/102368/victory-is-sweet-we-can-now-fix-mcdonalds-ice-cream-machines",
    "score": 911,
    "author": "LorenDB",
    "comments": 238
  },
  {
    "rank": 25,
    "title": "Wikipedia article blocked worldwide by Delhi high court",
    "link": "https://en.wikipedia.org/wiki/Asian_News_International_vs._Wikimedia_Foundation",
    "score": 596,
    "author": "intunderflow",
    "comments": 336,
    "summary": "Delhi High Court has blocked access to a Wikipedia article worldwide in a dispute between Asian News International and Wikimedia Foundation. Despite this, Wikimedia remains committed to ensuring access to free knowledge for all. Legal proceedings are ongoing, and updates will follow. Stay tuned for more on this developing story. #Wikipedia #KnowledgeForAll #LegalDispute",
    "translated_summary": "La Corte Suprema de Delhi ha bloqueado el acceso a un artículo de Wikipedia a nivel mundial en una disputa entre Asian News International y la Fundación Wikimedia. A pesar de esto, Wikimedia sigue comprometida en garantizar el acceso al conocimiento gratuito para todos. Los procedimientos legales siguen en curso y se proporcionarán actualizaciones. Mantente atento para más información sobre esta historia en desarrollo. #Wikipedia #ConocimientoParaTodos #DisputaLegal",
    "script": "¿Quieres saber la última noticia en el mundo de la tecnología? La Corte Suprema de Delhi ha tomado una decisión impactante bloqueando el acceso a un artículo de Wikipedia a nivel mundial. Una disputa entre Asian News International y la Fundación Wikimedia ha desencadenado este evento, generando controversia en torno al acceso a la información. Sin embargo, es importante señalar que la Fundación Wikimedia se mantiene firme en su compromiso de brindar acceso al conocimiento de manera gratuita para todos, a pesar de este revés legal.\n\nEs crucial entender que estamos ante un momento delicado en cuanto a la disponibilidad de información en línea. Estos conflictos nos obligan a reflexionar sobre los límites del acceso a la información y cómo se gestionan los derechos de autor en un mundo cada vez más interconectado. La transparencia y la apertura son fundamentales para el flujo libre de ideas y el enriquecimiento intelectual de la sociedad en su conjunto.\n\nA medida que los procedimientos legales continúan su curso, es vital mantenernos informados y alerta. Este incidente es un recordatorio de la importancia de proteger la diversidad de opiniones y perspectivas que hacen que plataformas como Wikipedia sean tan valiosas para el aprendizaje y la investigación. Seguiremos atentos a las actualizaciones sobre esta historia en desarrollo para comprender mejor las implicaciones de este bloqueo a nivel global.\n\nSi te interesa estar al tanto de cómo evoluciona esta situación y conocer más detalles sobre este caso, te invito a suscribirte para recibir información actualizada. Juntos podemos reflexionar sobre el impacto de estas decisiones en nuestro acceso al conocimiento. #Wikipedia #ConocimientoParaTodos #DisputaLegal"
  },
  {
    "rank": 4,
    "title": "Before you buy a domain name, first check to see if it's haunted",
    "link": "https://www.bryanbraun.com/2024/10/25/before-you-buy-a-domain-name-first-check-to-see-if-its-haunted/",
    "score": 588,
    "author": "bryanbraun",
    "comments": 119,
    "summary": "Be cautious before buying a domain name – it could be haunted! Blogger Bryan Braun shares his experience with a tainted domain, revealing how past issues like copyright violations can linger and impact a site's search engine ranking, even with new ownership. Check the domain's history on the Wayback Machine, search for DMCA complaints, and review historical SEO data to avoid potential ghosts in your digital real estate. #DomainName #SEOAdvice #HauntedDomains",
    "translated_summary": "Ten cuidado antes de comprar un nombre de dominio: ¡podría estar embrujado! El blogger Bryan Braun comparte su experiencia con un dominio contaminado, revelando cómo problemas pasados como infracciones de copyright pueden persistir e impactar el ranking del sitio en los motores de búsqueda, incluso con nueva propiedad. Revisa la historia del dominio en la Wayback Machine, busca quejas de DMCA y revisa datos históricos de SEO para evitar posibles fantasmas en tu propiedad digital. #NombreDeDominio #ConsejosDeSEO #DominiosEmbrujados",
    "script": "¡Atención, comunidad digital! Hoy nos sumergimos en el misterioso mundo de los nombres de dominio, un tema que suele pasar desapercibido pero que puede esconder secretos inesperados. Bryan Braun nos alerta sobre un problema poco común pero impactante: dominios embrujados. Sí, así como lo escuchas, antes de adquirir un nombre de dominio, conviene hacer una investigación profunda para evitar sustos inesperados.\n\nLa historia que Braun comparte es reveladora: un dominio con un pasado turbio de infracciones de copyright puede seguir persiguiendo a sus dueños posteriores, afectando incluso el posicionamiento en buscadores. ¡Imagina heredar un problema sin saberlo! Por suerte, el consejo es claro: antes de lanzarte a la compra de un dominio, dedica tiempo a investigar su historial en la Wayback Machine, verifica que no haya quejas de DMCA y analiza datos históricos de SEO. ¡Prevenir es la clave!\n\nAsí que, querida audiencia, antes de incurrir en la adquisición de un nombre de dominio aparentemente fantástico, recuerda que es crucial realizar una diligente revisión en busca de cualquier indicio de actividad espectral digital que pueda acechar. La precaución nunca está de más en el mundo cibernético.\n\nMantente atento, investiga a fondo y asegura tu presencia en línea contra los malos espíritus digitales. ¡Suscríbete para más consejos sobre tecnología y sé el protagonista de tu propia travesía digital! #SEO #Dominios #TerritoriosDigitales"
  },
  {
    "rank": 9,
    "title": "In the US, regenerative farming practices require unlearning past advice",
    "link": "https://investigatemidwest.org/2024/10/11/regenerative-farming-practices-require-unlearning-past-advice/",
    "score": 219,
    "author": "PaulHoule",
    "comments": 91
  },
  {
    "rank": 18,
    "title": "A deep dive into Linux's new mseal syscall",
    "link": "https://blog.trailofbits.com/2024/10/25/a-deep-dive-into-linuxs-new-mseal-syscall/",
    "score": 219,
    "author": "todsacerdoti",
    "comments": 44,
    "summary": "Linux's new mseal syscall introduces memory sealing to protect against illicit modifications during program runtime. It aims to prevent exploit scenarios like permissions tampering and memory unmapping attacks in Linux userspace. Unlike prior memory protection schemes, mseal is tailored for exploit mitigation against remote attackers seeking code execution. The syscall's simple implementation involves specifying memory ranges to seal. This innovation is significant for enhancing security measures in Linux environments.",
    "translated_summary": "La nueva syscall mseal de Linux introduce el sellado de memoria para protegerse contra modificaciones ilícitas durante la ejecución del programa. Su objetivo es prevenir escenarios de explotación como la manipulación de permisos y ataques de desmapeo de memoria en el espacio de usuario de Linux. A diferencia de los esquemas de protección de memoria anteriores, mseal está diseñado para mitigar exploits contra atacantes remotos que buscan ejecutar código. La implementación simple de la syscall implica especificar rangos de memoria para sellar. Esta innovación es importante para mejorar las medidas de seguridad en entornos de Linux.",
    "script": "¡Hola a todos! Hoy quiero compartir con ustedes un tema que considero fundamental en el mundo de la tecnología: la nueva syscall mseal de Linux. Este desarrollo ha generado mucho interés en la comunidad debido a su enfoque en la protección de la memoria contra modificaciones no autorizadas durante la ejecución de programas.\n\nLa syscall mseal tiene como principal objetivo prevenir posibles escenarios de explotación, como la manipulación de permisos y ataques de desmapeo de memoria en el espacio de usuario de Linux. Su diseño busca mitigar exploits contra atacantes remotos que buscan ejecutar código de forma malintencionada.\n\nLo interesante de esta innovación radica en su implementación simple, que implica especificar rangos de memoria a sellar. Esta estrategia se presenta como una mejora significativa en las medidas de seguridad de los entornos Linux, ya que ayuda a fortalecer las defensas contra posibles vulnerabilidades.\n\nEs importante resaltar que la introducción de la syscall mseal marca un avance significativo en la protección de la memoria en sistemas operativos Linux, contribuyendo a la seguridad y robustez de las aplicaciones que se ejecutan en esta plataforma.\n\nSi desean mantenerse actualizados sobre temas de tecnología y seguridad, los invito a suscribirse a nuestro canal para recibir más contenido de calidad como este. ¡Hasta la próxima!"
  },
  {
    "rank": 20,
    "title": "Battleships Logic Puzzle",
    "link": "https://lukerissacher.com/battleships",
    "score": 216,
    "author": "QuadrupleA",
    "comments": 74,
    "summary": "Engage your mind with Battleship Logic Puzzle! Place ships and water in squares to solve the puzzle, inspired by Battleship Solitaire. Use strategic tips like \"Only-spots-left\" and \"Water-on-corners\" rules to navigate the challenge. Playable on mobile for casual fun. Test your skills with hard mode for an extra challenge. Sharpen your logic skills while enjoying podcasts. #logicpuzzle #battleships #mindgames",
    "translated_summary": "¡Poné a prueba tu mente con el Rompecabezas de Lógica de Batalla Naval! Colocá barcos y agua en los cuadrados para resolver el rompecabezas, inspirado en Batalla Naval Solitario. Usá consejos estratégicos como las reglas de \"Solo-lugares-restantes\" y \"Agua-en-esquinas\" para navegar el desafío. Jugable en dispositivos móviles para divertirse de manera casual. Poné a prueba tus habilidades con el modo difícil para un desafío extra. Afila tus habilidades lógicas mientras disfrutás de podcasts. #rompecabezaslógico #batallanaval #juegosmentales",
    "script": "¡Hola a todos! Hoy quiero contarles sobre un interesante rompecabezas que está dando que hablar en el mundo de los juegos mentales: el Rompecabezas de Lógica de Batalla Naval. Una propuesta que desafía tu mente y estrategia a través de la colocación de barcos y agua en cuadrados específicos para resolver el desafío.\n\nEste juego, inspirado en Batalla Naval Solitario, te invita a utilizar consejos estratégicos como las reglas de \"Solo-lugares-restantes\" y \"Agua-en-esquinas\" para navegar por cada nivel. ¿Lo interesante? Puedes disfrutarlo en dispositivos móviles, ideal para momentos de ocio o esperas cortas.\n\n¿Quieres llevar tus habilidades al siguiente nivel? El modo difícil pondrá a prueba tus capacidades lógicas, ofreciéndote un desafío extra que seguro te mantendrá entretenido. Y lo mejor, ¡podrás disfrutar de tus podcasts favoritos mientras ejercitas tu mente!\n\nEste tipo de juegos puede ser una excelente forma de mantener la mente activa y afilar nuestras habilidades lógicas. ¿Por qué no intentarlo y ver hasta dónde llegas?\n\nRecuerda, la vida nos plantea desafíos constantes, y estar preparados para resolver problemas de manera estratégica siempre es una buena cualidad. Así que, ¿por qué no poner a prueba tu mente con este rompecabezas de lógica?\n\nSi te gusta ejercitar tu mente y buscas nuevas formas de entretenimiento, ¡no dudes en probar el Rompecabezas de Lógica de Batalla Naval! Demuestra tus habilidades y disfruta de un desafío que te mantendrá enganchado.\n\nY si te interesa seguir descubriendo novedades en el mundo de la tecnología y los juegos, te invito a suscribirte a nuestro canal para estar al tanto de todas las actualizaciones. ¡Nos vemos en el próximo video! #rompecabezaslógico #batallanaval #juegosmentales"
  },
  {
    "rank": 6,
    "title": "How can this 6 axis robot have a static accuracy of 0.05 mm? (2021) [video]",
    "link": "https://www.youtube.com/watch?v=SioCwvR_PYY",
    "score": 202,
    "author": "unclefuzzy",
    "comments": 63
  },
  {
    "rank": 11,
    "title": "Adventures in algorithmic trading on the Runescape Grand Exchange",
    "link": "https://tristanrhodes.com/blog/Adventures-in-Algorithmic-Trading-on-the-Runescape-Grand-Exchange",
    "score": 133,
    "author": "partypete",
    "comments": 19,
    "summary": "Dive into the world of algorithmic trading on the Runescape Grand Exchange with Tristan Rhodes! In this blog post, Tristan shares his adventures in creating a bot that uses machine learning techniques for market making. Learn about the unique features of the Grand Exchange, the bot's components, data pipeline for ML models, and baseline method for performance evaluation. Uncover the insights and results from Tristan's experiment with different trading algorithms. A fascinating blend of gaming, programming, and finance awaits! #Runescape #AlgorithmicTrading #MachineLearning.",
    "translated_summary": "Sumergite en el mundo del trading algorítmico en el Mercado Principal de Runescape con Tristan Rhodes. En esta publicación de blog, Tristan comparte sus aventuras en la creación de un bot que utiliza técnicas de aprendizaje automático para la creación de mercados. Conocé las características únicas del Mercado Principal, los componentes del bot, el pipeline de datos para los modelos de ML y el método base para la evaluación del rendimiento. Descubrí las ideas y resultados de la experimentación de Tristan con diferentes algoritmos de trading. ¡Una fascinante combinación de juegos, programación y finanzas te espera! #Runescape #TradingAlgorítmico #AprendizajeAutomático.",
    "script": "¡Hey, comunidad tech! ¿Listos para adentrarnos juntos en el mundo del trading algorítmico en el Runescape Grand Exchange? Hoy exploramos las aventuras de Tristan Rhodes y su innovador bot basado en técnicas de aprendizaje automático.\n\nTristan comparte en su blog los entresijos de este apasionante proyecto: desde las particularidades del Mercado Principal de Runescape, hasta los detalles de su bot y el pipeline de datos para los modelos de ML. ¿Interesante, verdad?\n\nLo más destacado aquí es la experimentación de Tristan con diversos algoritmos de trading. A través de su enfoque meticuloso, logra analizar el rendimiento de cada uno, ofreciendo valiosas conclusiones sobre su efectividad en un entorno tan singular como este.\n\nLa combinación entre juegos, programación y finanzas que propone esta iniciativa es, sin duda, un terreno fértil para la exploración y el aprendizaje continuo. Tristan nos invita a reflexionar sobre las posibilidades y desafíos que entraña esta fusión de disciplinas.\n\nY es que, más allá de la fascinación inicial, es crucial que mantengamos una mirada crítica y equilibrada ante estas nuevas fronteras digitales. Tomar distancia, evaluar objetivamente y estar al tanto de las implicancias éticas de nuestras acciones son aspectos imprescindibles en este recorrido.\n\nAsí que, si te apasiona la intersección entre tecnología, creatividad y análisis, te invito a seguir de cerca las travesías de Tristan en este universo de trading algorítmico en Runescape. ¡Suscríbete y sé parte de esta conversación en constante evolución!\n\n#Runescape #TradingAlgorítmico #AprendizajeAutomático."
  },
  {
    "rank": 17,
    "title": "Ikigai: The Japanese Secret to a Joyful Life",
    "link": "https://www.japan.go.jp/kizuna/2022/03/ikigai_japanese_secret_to_a_joyful_life.html",
    "score": 131,
    "author": "craigkerstiens",
    "comments": 74
  },
  {
    "rank": 27,
    "title": "Astronomers discover complex carbon molecules in interstellar space",
    "link": "https://www.sciencealert.com/astronomers-discover-complex-carbon-molecules-in-interstellar-space",
    "score": 116,
    "author": "Brajeshwar",
    "comments": 19
  },
  {
    "rank": 1,
    "title": "New Windows Driver Signature bypass allows kernel rootkit installs",
    "link": "https://www.bleepingcomputer.com/news/security/new-windows-driver-signature-bypass-allows-kernel-rootkit-installs/",
    "score": 115,
    "author": "sandwichsphinx",
    "comments": 58
  },
  {
    "rank": 12,
    "title": "We Can Terraform the American West",
    "link": "https://caseyhandmer.wordpress.com/2024/10/26/we-can-terraform-the-american-west/",
    "score": 93,
    "author": "jasondavies",
    "comments": 108
  },
  {
    "rank": 30,
    "title": "Kronos: Soviet Processor Family for High-Level Languages (2006) [pdf]",
    "link": "https://inria.hal.science/hal-01568396v1/document",
    "score": 50,
    "author": "mepian",
    "comments": 8
  },
  {
    "rank": 24,
    "title": "Fitting a Forth in 512 bytes (2021)",
    "link": "https://compilercrim.es/bootstrap/miniforth/",
    "score": 47,
    "author": "whereistimbo",
    "comments": 2
  },
  {
    "rank": 10,
    "title": "Cancellation of Naval Academy Lecture by Ruth Ben-Ghiat Threatens Inst. Autonomy",
    "link": "https://pen.org/press-release/cancellation-of-naval-academy-lecture-by-ruth-ben-ghiat-at-behest-of-republican-politicians-threatens-institutional-autonomy/",
    "score": 36,
    "author": "the_why_of_y",
    "comments": 7
  },
  {
    "rank": 3,
    "title": "Should JavaScript be split into two languages? Google proposal divides opinion",
    "link": "https://devclass.com/2024/10/22/should-javascript-be-split-into-two-languages-new-google-driven-proposal-divides-opinion/",
    "score": 34,
    "author": "em-bee",
    "comments": 36
  },
  {
    "rank": 16,
    "title": "The Rise of Giant Pumpkins",
    "link": "https://www.saturdayeveningpost.com/2024/10/our-better-nature-great-pumpkins/",
    "score": 30,
    "author": "bookofjoe",
    "comments": 18
  },
  {
    "rank": 5,
    "title": "Live imaging of ovulation in action reveals three distinct phases",
    "link": "https://phys.org/news/2024-10-imaging-ovulation-action-reveals-distinct.html",
    "score": 23,
    "author": "wglb",
    "comments": 0
  },
  {
    "rank": 29,
    "title": "Light and Shadow",
    "link": "https://catlikecoding.com/godot/true-top-down-2d/4-light-and-shadow/",
    "score": 21,
    "author": "ibobev",
    "comments": 0
  },
  {
    "rank": 26,
    "title": "Her Majesty’s Rat-Catcher (2013)",
    "link": "https://www.laphamsquarterly.org/roundtable/her-majestys-rat-catcher",
    "score": 20,
    "author": "samclemens",
    "comments": 4
  },
  {
    "rank": 15,
    "title": "How do you put on an Apollo spacesuit?",
    "link": "https://airandspace.si.edu/stories/editorial/how-do-you-put-apollo-spacesuit",
    "score": 16,
    "author": "airstrike",
    "comments": 3
  },
  {
    "rank": 19,
    "title": "Collapse of key Atlantic current could have catastrophic impacts",
    "link": "https://www.livescience.com/planet-earth/rivers-oceans/we-dont-really-consider-it-low-probability-anymore-collapse-of-key-atlantic-current-could-have-catastrophic-impacts-says-oceanographer-stefan-rahmstorf",
    "score": 11,
    "author": "Brajeshwar",
    "comments": 1
  }
]