[
  {
    "rank": 28,
    "title": "AWS data center latencies, visualized",
    "link": "https://benjdd.com/aws/",
    "score": 454,
    "author": "orliesaurus",
    "comments": 184
  },
  {
    "rank": 16,
    "title": "Show HN: Wall-mounted diffusion mirror that turns reflections into paintings",
    "link": "https://www.matthieulc.com/posts/pablonet/",
    "score": 432,
    "author": "cataPhil",
    "comments": 109,
    "summary": "Discover an innovative wall-mounted diffusion mirror that transforms reflections into mesmerizing paintings, created using AI technology. This unique piece explores creativity and art, emphasizing the blending of the inner world with skill. The mirror provides a new way to experience art with its interactive features, offering a permanent and evolving artistic display. Want to create your own? Check out the details shared for this inspiring project! #ArtTech #Innovation #CreateYourOwn",
    "translated_summary": "Descubrí un espejo de difusión innovador montado en la pared que transforma las reflexiones en pinturas hipnotizantes, creadas utilizando tecnología de inteligencia artificial. Esta pieza única explora la creatividad y el arte, haciendo hincapié en la fusión del mundo interior con habilidad. El espejo brinda una nueva forma de experimentar el arte con sus funciones interactivas, ofreciendo una exposición artística permanente y en constante evolución. ¿Querés crear el tuyo propio? ¡Chequeá los detalles compartidos para este proyecto inspirador! #ArtTech #Innovación #CreaTuPropio",
    "script": "Hoy vamos a hablar de una interesante innovación en el mundo del arte y la tecnología. Se ha presentado un espejo de difusión montado en la pared que convierte simples reflejos en fascinantes obras de arte, gracias al uso de inteligencia artificial. Una propuesta que despierta la curiosidad y creatividad en un matrimonio entre lo visual y lo técnico.\n\nEste espejo no es solo un objeto decorativo, sino una ventana a un mundo en el que las fronteras entre lo tangible y lo virtual se desdibujan. Al interactuar con este espejo, los usuarios se adentran en un universo fascinante donde la imaginación y la tecnología se funden para crear una experiencia artística única.\n\nLa propuesta de este dispositivo va más allá de simplemente decorar una pared. Se trata de invitar al espectador a sumergirse en un ambiente artístico en constante evolución, donde cada reflejo se convierte en una nueva oportunidad para la inspiración y la contemplación.\n\nPara aquellos interesados en explorar su propia creatividad a través de esta innovadora herramienta, les invito a conocer más detalles sobre este proyecto. La posibilidad de transformar un reflejo cotidiano en una obra de arte personalizada representa un emocionante desafío para todos aquellos que buscan nutrir su lado creativo.\n\nSi deseas descubrir más sobre esta fusión entre arte y tecnología, te animo a explorar los detalles compartidos sobre este intrigante espejo de difusión montado en la pared. Una oportunidad única para sumergirte en un territorio donde la creatividad y la innovación se entrelazan de forma inesperada. Es hora de despertar tu imaginación y explorar el potencial de esta emocionante propuesta. ¡No te lo pierdas! #ArtTech #Innovación #CreaTuPropio. ¡Suscríbete para más contenidos relacionados con tecnología y creatividad!"
  },
  {
    "rank": 5,
    "title": "JetBrains Rider is now free for non-commercial use",
    "link": "https://www.jetbrains.com/rider/",
    "score": 423,
    "author": "kretaceous",
    "comments": 202
  },
  {
    "rank": 18,
    "title": "Show HN: RF Hunter – Find hidden cameras and other devices",
    "link": "https://github.com/RamboRogers/rfhunter",
    "score": 354,
    "author": "RamboRogers",
    "comments": 105,
    "summary": "Check out the RFHunter project by Matthew Rogers on GitHub, a device to detect hidden cameras and RF devices with an ESP32 and AD8317 RF detector. The scanner displays signal strength on an OLED screen. V4 is user-friendly with a battery and improved efficiency. Useful for security-conscious individuals. #RFHunter #HiddenCameras #SecurityDetection",
    "translated_summary": "Chequeá el proyecto RFHunter de Matthew Rogers en GitHub, un dispositivo para detectar cámaras ocultas y dispositivos de RF con un ESP32 y un detector de RF AD8317. El escáner muestra la intensidad de la señal en una pantalla OLED. La V4 es amigable para el usuario con una batería y una eficiencia mejorada. Útil para personas conscientes de la seguridad. #RFHunter #CámarasOcultas #DetecciónDeSeguridad",
    "script": "¡Hola a todos! ¿Pensaste alguna vez en lo fácil que podría ser estar siendo vigilado sin siquiera saberlo? Hoy les traigo una noticia que provocará escalofríos a más de uno.\n\n¿Imaginan poder detectar cámaras ocultas y otros dispositivos de radiofrecuencia con una simple herramienta? Pues bien, gracias al ingenio de Matthew Rogers, eso ya es posible con RF Hunter.\n\nEste proyecto, disponible en GitHub, utiliza un ESP32 y un detector de RF AD8317 para escanear y mostrar la intensidad de la señal en una pantalla OLED. Una herramienta que evoca a la conciencia de seguridad y privacidad de cada uno de nosotros. \n\nLa versión 4 de RF Hunter no solo es más amigable para el usuario, sino que también ha mejorado su eficiencia al integrar una batería para mayor portabilidad. Una solución práctica y sencilla para aquellos que desean sentirse más seguros en su entorno.\n\nNo podemos negar la relevancia y utilidad de esta innovación en un mundo donde la privacidad está tan amenazada. Sin embargo, como en todo avance tecnológico, debemos ser conscientes de cómo y cuándo utilizar estas herramientas, recordando siempre el equilibrio entre seguridad y libertad.\n\nLes invito a revisar el proyecto RF Hunter en GitHub y explorar más sobre cómo podemos proteger nuestra privacidad en un mundo cada vez más conectado. ¡Descubramos juntos nuevas formas de hacer frente a los desafíos tecnológicos de hoy!\n\nSi les interesa estar al tanto de más noticias y desarrollos tecnológicos relevantes, ¡no olviden suscribirse a nuestro canal! Juntos seguiremos explorando el impacto de la tecnología en nuestras vidas. ¡Hasta la próxima!"
  },
  {
    "rank": 30,
    "title": "What happens when you make a move in lichess.org?",
    "link": "https://www.davidreis.me/2024/what-happens-when-you-make-a-move-in-lichess",
    "score": 333,
    "author": "dreis_sw",
    "comments": 135,
    "summary": "Ever wondered what happens behind the scenes when you make a move in lichess.org? Discover the technical magic powering this real-time chess platform. From WebSocket connections to data exchanges, each move triggers a series of intricate processes between client and server. This peek into the backend reveals how moves are acknowledged, game states are updated, and possible moves are highlighted. Dive into the world of online chess with a fresh perspective! 🎲🔍 #OnlineChess #TechBehindGames",
    "translated_summary": "¿Alguna vez te preguntaste qué sucede detrás de escena cuando realizas un movimiento en lichess.org? Descubre la magia técnica que impulsa esta plataforma de ajedrez en tiempo real. Desde conexiones WebSocket hasta intercambios de datos, cada movimiento desencadena una serie de procesos intrincados entre el cliente y el servidor. Esta mirada al backend revela cómo se confirman los movimientos, se actualizan los estados del juego y se destacan los posibles movimientos. ¡Sumérgete en el mundo del ajedrez online con una perspectiva fresca! 🎲🔍 #AjedrezOnline #TecnologíaDetrásDeLosJuegos",
    "script": "¿Te has preguntado alguna vez qué sucede en lichess.org cada vez que haces un movimiento en una partida de ajedrez online? Detrás de la pantalla, se pone en marcha un fascinante ballet de procesos técnicos que hacen posible esta experiencia única. Desde la confirmación de tu jugada hasta la actualización del estado del juego, cada movimiento desata una compleja danza de intercambio de datos entre tu dispositivo y los servidores de lichess. \n\n¿Qué elementos hacen posible esta magia técnica? La clave radica en las conexiones WebSocket, un protocolo que permite la comunicación bidireccional en tiempo real entre el cliente y el servidor. Gracias a esta tecnología, tu jugada es enviada al servidor de lichess, donde se valida, se actualiza el estado del tablero y se envían las posibles respuestas de tu oponente de vuelta a tu dispositivo, todo en cuestión de milisegundos.\n\nSumérgete en el mundo del ajedrez online con esta reveladora mirada al backend de lichess.org. Cada movimiento, cada decisión estratégica, se traduce en una compleja secuencia de eventos que nos recuerda la sofisticación tecnológica que sustenta nuestros pasatiempos digitales. \n\nInvito a que reflexionemos sobre el equilibrio necesario entre la magia del juego y la infraestructura técnica que lo hace posible. La belleza del ajedrez está en la estrategia, en la mente humana compitiendo en un campo de batalla virtual. Pero detrás de esa experiencia, hay un entramado de tecnología que funciona silenciosamente para llevar nuestra pasión por el juego a nuevas alturas.\n\nAsí que, ¿te animas a dar el siguiente movimiento en lichess.org y apreciar la complejidad técnica detrás de cada jugada? Suscríbete para seguir explorando el apasionante mundo de la tecnología y el entretenimiento. ¡Hasta la próxima jugada! #AjedrezOnline #TecnologíaDetrásDeLosJuegos"
  },
  {
    "rank": 14,
    "title": "Pretty.c",
    "link": "https://github.com/aartaka/pretty.c",
    "score": 290,
    "author": "synergy20",
    "comments": 175,
    "summary": "\"Introducing Pretty C, a new scripting language compatible with C that adds dynamic typing and other features inspired by Lua, Python, JavaScript, and Lisp. It aims to provide a simpler, beginner-friendly coding experience while maintaining compatibility with C libraries. Pretty C can transform your C code into something enchanting and easy to read. Check it out on GitHub!\"",
    "translated_summary": "Te presento a Pretty C, un nuevo lenguaje de programación compatible con C que agrega tipado dinámico y otras características inspiradas en Lua, Python, JavaScript y Lisp. Su objetivo es brindar una experiencia de codificación más simple y amigable para principiantes, manteniendo la compatibilidad con las bibliotecas de C. Pretty C puede transformar tu código de C en algo encantador y fácil de leer. ¡Échale un vistazo en GitHub!",
    "script": "¡Hola a todos! Hoy les traigo una interesante novedad del mundo de la programación. Se trata de Pretty C, un nuevo lenguaje de programación que promete simplificar el proceso de codificación, especialmente para aquellos que están dando sus primeros pasos en este apasionante mundo. Pretty C ha llamado la atención por ser compatible con C, pero añadiendo características de tipado dinámico y tomando inspiración de varios lenguajes populares como Lua, Python, JavaScript y Lisp.\n\nLa idea detrás de Pretty C es brindar una experiencia más amigable y accesible a los principiantes, sin sacrificar la compatibilidad con las bibliotecas existentes de C. Esta combinación busca hacer que el código sea más legible y encantador, facilitando su comprensión y mantenimiento a lo largo del tiempo.\n\nSin embargo, como en toda innovación, también hay aspectos a considerar. A pesar de sus ventajas, la introducción de un nuevo lenguaje conlleva el desafío de la adopción por parte de la comunidad y la garantía de su soporte a largo plazo. Es importante evaluar cómo Pretty C se integrará en el ecosistema de desarrollo de software y si logrará establecerse como una herramienta útil y relevante en el tiempo.\n\nPara aquellos interesados en explorar más sobre este nuevo lenguaje, les invito a que visiten su repositorio en GitHub, donde podrán conocer más detalles y contribuir a su desarrollo. Mantenernos informados y abiertos a nuevas propuestas en el ámbito de la programación es fundamental para seguir evolucionando en este campo tan dinámico y cambiante.\n\nAsí que, si te apasiona la programación y te gusta estar al tanto de las últimas tendencias, te animo a que explores Pretty C y saques tus propias conclusiones sobre su potencial. ¡Hasta la próxima y no olvides suscribirte para más novedades tecnológicas!"
  },
  {
    "rank": 24,
    "title": "NetGuard – rootless Android outbound per-app OSS firewall, like LittleSnitch",
    "link": "https://netguard.me/",
    "score": 214,
    "author": "transpute",
    "comments": 123,
    "summary": "NetGuard is a rootless firewall app for Android that allows users to block internet access per application without requiring root access. It offers features like data usage reduction, battery saving, and increased privacy. The app is open-source, with options for pro features like traffic log viewing and network traffic filtering. By making a donation, users can access the pro features and support ongoing development. It's a valuable tool for controlling internet access on Android devices. #NetGuard #Firewall #AndroidPrivacy",
    "translated_summary": "NetGuard es una aplicación de firewall sin necesidad de ser root para Android que permite a los usuarios bloquear el acceso a internet por aplicación sin necesidad de acceso de raíz. Ofrece funciones como reducción del uso de datos, ahorro de batería y aumento de la privacidad. La aplicación es de código abierto, con opciones de características profesionales como la visualización de registro de tráfico y el filtrado de tráfico de red. Al hacer una donación, los usuarios pueden acceder a las características profesionales y apoyar el desarrollo continuo. Es una herramienta valiosa para controlar el acceso a internet en dispositivos Android. #NetGuard #Firewall #PrivacidadAndroid",
    "script": "¡Hola a todos! Hoy quiero compartir con ustedes una interesante noticia del mundo tecnológico que ha llamado mi atención. Se trata de NetGuard, una aplicación de firewall para Android que ha estado generando cierto revuelo últimamente. Lo que hace NetGuard es permitir a los usuarios bloquear el acceso a internet por aplicación, sin necesidad de tener acceso de raíz en su dispositivo. Interesante, ¿verdad?\n\nLo más destacado de NetGuard es su enfoque en la privacidad y control del tráfico de red. Al utilizar esta herramienta, los usuarios pueden reducir el uso de datos, ahorrar batería y mantener una mayor privacidad en sus dispositivos Android. Ahora, lo que realmente distingue a NetGuard es que es una aplicación de código abierto, lo cual siempre es una buena noticia para la comunidad tecnológica.\n\nAdemás, NetGuard ofrece funciones profesionales opcionales, como la visualización de registros de tráfico y el filtrado del tráfico de red. Esto permite a los usuarios un mayor control sobre qué aplicaciones pueden acceder a internet y cuáles no. Y lo mejor de todo, aquellos que deseen acceder a estas funciones pueden hacerlo a través de una donación, lo que no solo desbloqueará características profesionales, sino que también apoyará el desarrollo continuo de la aplicación.\n\nEn resumen, NetGuard se presenta como una herramienta valiosa para aquellos que buscan controlar el acceso a internet en sus dispositivos Android, sin necesidad de permisos de raíz. Una interesante propuesta que demuestra que la privacidad y el control de nuestros datos siguen siendo aspectos importantes en el mundo digital actual.\n\nSi desean mantenerse al tanto de más noticias y novedades tecnológicas como esta, los invito a suscribirse al canal y seguir explorando juntos este fascinante mundo de la tecnología. ¡Hasta pronto! #NetGuard #Firewall #PrivacidadAndroid"
  },
  {
    "rank": 20,
    "title": "Show HN: Satoshi9000 analog BTC key generator (mechanical)",
    "link": "https://news.ycombinator.com/item?id=41929822",
    "score": 139,
    "author": "AJTSheppard",
    "comments": 47
  },
  {
    "rank": 27,
    "title": "Show HN: Which Animal Shares Your Body Fat Percentage?",
    "link": "https://animalbodyfatmatch.netlify.app/",
    "score": 126,
    "author": "Atallapr",
    "comments": 83
  },
  {
    "rank": 1,
    "title": "Launch HN: Skyvern (YC S23) – open-source AI agent for browser automations",
    "link": "https://news.ycombinator.com/item?id=41936745",
    "score": 98,
    "author": "suchintan",
    "comments": 23
  },
  {
    "rank": 15,
    "title": "Lost Silk Road Cities Discovered High in the Mountains of Central Asia",
    "link": "https://www.scientificamerican.com/article/lost-silk-road-cities-discovered-high-in-the-mountains-of-central-asia/",
    "score": 76,
    "author": "Brajeshwar",
    "comments": 7
  },
  {
    "rank": 19,
    "title": "How to grip Bronze Age swords",
    "link": "https://www.bookandsword.com/2024/10/19/how-to-grip-bronze-age-swords-response-to-dimicator-and-matt-easton/",
    "score": 74,
    "author": "speckx",
    "comments": 59
  },
  {
    "rank": 21,
    "title": "Sinusoidal Sunlight",
    "link": "https://leancrew.com/all-this/2024/10/sinusoidal-sunlight/",
    "score": 74,
    "author": "surprisetalk",
    "comments": 25
  },
  {
    "rank": 25,
    "title": "Building Document-Centric, CRDT-Native Editors",
    "link": "https://blocksuite.io/blog/document-centric.html",
    "score": 69,
    "author": "rapnie",
    "comments": 17
  },
  {
    "rank": 4,
    "title": "Riot Games: Peeking into Valorant's Netcode (2020)",
    "link": "https://technology.riotgames.com/news/peeking-valorants-netcode",
    "score": 60,
    "author": "jakey_bakey",
    "comments": 16
  },
  {
    "rank": 9,
    "title": "Ozempic linked to lower Alzheimer's risk in people with Type 2 diabetes",
    "link": "https://www.nbcnews.com/health/health-news/ozempic-linked-lower-alzheimers-risk-people-type-2-diabetes-rcna176821",
    "score": 42,
    "author": "benchtobedside",
    "comments": 11
  },
  {
    "rank": 3,
    "title": "Post World War II Food",
    "link": "https://www.nps.gov/articles/post-wwii-food.htm",
    "score": 38,
    "author": "paulpauper",
    "comments": 21
  },
  {
    "rank": 26,
    "title": "A field guide to the central, creeping section of the San Andreas Fault (2006)",
    "link": "https://www.researchgate.net/publication/262263511_A_field_guide_to_the_central_creeping_section_of_the_San_Andreas_Fault_and_the_San_Andreas_Fault_Observatory_at_Depth",
    "score": 35,
    "author": "pastureofplenty",
    "comments": 22
  },
  {
    "rank": 22,
    "title": "The Lion of St. Mark's Square in Venice Is Chinese: Isotopic Analyses Confirm It",
    "link": "https://archaeologymag.com/2024/09/lion-of-st-marks-square-in-venice-is-chinese/",
    "score": 22,
    "author": "pseudolus",
    "comments": 2
  },
  {
    "rank": 7,
    "title": "The Rise and Fall of IQ: The Cognitive Divide",
    "link": "https://onepercentrule.substack.com/p/the-rise-and-fall-of-iq-the-cognitive",
    "score": 20,
    "author": "drcwpl",
    "comments": 14
  },
  {
    "rank": 23,
    "title": "Why that one coworker got fired for no reason",
    "link": "https://gieseanw.wordpress.com/2024/10/24/why-that-one-coworker-got-fired-for-no-reason/",
    "score": 17,
    "author": "andyg_blog",
    "comments": 13
  },
  {
    "rank": 29,
    "title": "Bay Area cops are getting a new Siri-type tool for fighting sideshows",
    "link": "https://www.sfgate.com/tech/article/bay-area-cops-get-sideshow-tool-flock-safety-19858497.php",
    "score": 17,
    "author": "c420",
    "comments": 18
  },
  {
    "rank": 12,
    "title": "Show HN: PreCog AI – Automatic AI Model Selection for Any Task",
    "link": "https://precog.ubik.studio/",
    "score": 11,
    "author": "ieuanking",
    "comments": 1
  },
  {
    "rank": 13,
    "title": "Security Research on Private Cloud Compute",
    "link": "https://security.apple.com/blog/pcc-security-research/",
    "score": 10,
    "author": "todsacerdoti",
    "comments": 0
  },
  {
    "rank": 8,
    "title": "Svix (YC W21) Is Hiring a Developer Marketer (US Remote)",
    "link": "https://www.svix.com/careers/?ashby_jid=1d4b2de4-e9a2-4e1b-9fcb-661e678ad7c6",
    "score": 0,
    "author": "Unknown",
    "comments": 0
  }
]